Revit 2027 API
ParameterTypeId.FbxLightEmitRectangleWidth Property
 "Emit from Rectangle Width"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FbxLightEmitRectangleWidth { get; }
Public Shared ReadOnly Property FbxLightEmitRectangleWidth As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FbxLightEmitRectangleWidth {
	ForgeTypeId^ get ();
}
static member FbxLightEmitRectangleWidth : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace